#Задание 1
#Создайте функцию-генератор countdown, которая выводит числа от 10 до 0.

#а) Опустошите генератор с помощью цикла б) Опустошите генератор с помощью next()

#подсказка: можно воспользоваться сочетанием цикла while и функцией next()

#Задание 2
#Напишите функцию-генератор, которая выдает буквы английского алфавита от a до z. Опустошите генератор любым способом

#Задание 3 *
#Напишите функцию-генератор, которая выводит 10 чисел Фибоначчи. Выведите числа в виде списка (list).

#Подсказка: можно использовать глобальную переменную

#Для справки: Числа Фибоначчи - это последовательность, в котором первые числа - это 0 и 1, а затем каждое последующее является суммой двух предыдущх:

#0 1 1 2 3 5 8 13 21 34

#Задание 4
#Напишите функцию итератор, которая будет перебирать список чисел Фибоначчи из предыдущего задания. Опустошите итератор двумя способами.

#Если вы не сделали предыдущее задание, воспользуйтесь списком: [0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

#Задание 5
#Создайте список четных чисел от 0 до 20 с помощью генератора списков

#Задание 6
#Создайте словарь, в котором ключом будет являться число от 1 до 23, а значением - буквы английского алфавита. Решите эту задачу с помощью генератора словаря

